#ifndef _CVI_SCL_H_
#define _CVI_SCL_H_

#include <base_ctx.h>
#include <base_cb.h>
#include <vpss_cb.h>

#define SCL_INTR_SCL_NUM 139
#ifdef  __SOC_MARS__
#define SCL_MAX_INST 4
#define SCL_V_MAX_INST 3	// sc_v1, sc_v2, sc_v3
#else
#define SCL_MAX_INST 3
#define SCL_V_MAX_INST 2	// sc_v1, sc_v2
#endif
#define SCL_D_MAX_INST 1
#define SCL_MIN_WIDTH  32
#define SCL_MAX_WIDTH  2880
#define SCL_MAX_HEIGHT 2880
#define SCL_MAX_DSI_LP 16
#define SCL_MAX_DSI_SP 2
#define SCL_MAX_GOP_OW_INST 8
#ifdef  __SOC_PHOBOS__
#define SCL_MAX_GOP_INST 1
#define SCL_MAX_GOP_FB_INST 1
#else
#define SCL_MAX_GOP_INST 2
#define SCL_MAX_GOP_FB_INST 2
#endif
#define SCL_MAX_COVER_INST 4
#define SCL_DEFAULT_BURST 7
#define SCL_DISP_GOP_BURST 15
#define SCL_DISP_GAMMA_NODE 65
#define SCL_MAX_RGNEX 32

#define IS_YUV_FMT(x) \
	((x == SCL_FMT_YUV420) || (x == SCL_FMT_YUV422) || \
	 (x == SCL_FMT_Y_ONLY) || (x >= SCL_FMT_NV12))
#define IS_PACKED_FMT(x) \
	((x == SCL_FMT_RGB_PACKED) || (x == SCL_FMT_BGR_PACKED) || \
	 (x == SCL_FMT_YVYU) || (x == SCL_FMT_YUYV) || \
	 (x == SCL_FMT_VYUY) || (x == SCL_FMT_UYVY))

#define TILE_GUARD_PIXEL 32

#define SCL_TILE_LEFT   (1 << 0)
#define SCL_TILE_RIGHT  (1 << 1)
#define SCL_TILE_BOTH   (SCL_TILE_LEFT | SCL_TILE_RIGHT)

#define TILE_ON_IMG

// img_in, odma
enum sclr_sb_mode {
	SCLR_SB_DISABLE = 0,
	SCLR_SB_FREE_RUN = 1,
	SCLR_SB_FRAME_BASE = 2,
	SCLR_SB_MODE_MAX
};

enum sclr_sb_size {
	SCLR_SB_64_LINE = 0, // img_in, odma
	SCLR_SB_128_LINE = 1, // img_in, odma
	SCLR_SB_192_LINE = 2, // img_in
	SCLR_SB_256_LINE = 3, // img_in
	SCLR_SB_SIZE_MAX
};

struct sclr_size {
	u16 w;
	u16 h;
};

struct sclr_point {
	u16 x;
	u16 y;
};

struct sclr_rect {
	u16 x;
	u16 y;
	u16 w;
	u16 h;
};

struct sclr_status {
	u8 crop_idle : 1;
	u8 hscale_idle : 1;
	u8 vscale_idle : 1;
	u8 gop_idle : 1;
	u8 wdma_idle : 1;
	u8 rsv : 2;
};

enum sclr_img_in {
	SCL_IMG_V,  // for video-encoder
	SCL_IMG_D,  // for display
	SCL_IMG_MAX,
};

enum sclr_input {
	SCL_INPUT_ISP,
	SCL_INPUT_DWA,
	SCL_INPUT_MEM,
	SCL_INPUT_MAX,
};

enum sclr_gop {
	SCL_GOP_SCD,
	SCL_GOP_SCV1,
	SCL_GOP_SCV2,
	SCL_GOP_SCV3,
	SCL_GOP_DISP,
	SCL_GOP_MAX,
};

enum sclr_scaling_coef {
	SCL_COEF_BICUBIC,
	SCL_COEF_BILINEAR,
	SCL_COEF_NEAREST,
	SCL_COEF_Z2,
	SCL_COEF_Z3,
	SCL_COEF_DOWNSCALE_SMOOTH,
	SCL_COEF_USER,
	SCL_COEF_MAX
};

enum sclr_cir_mode {
	SCL_CIR_EMPTY,
	SCL_CIR_SHAPE = 2,
	SCL_CIR_LINE,
	SCL_CIR_DISABLE,
	SCL_CIR_MAX,
};

struct sclr_csc_matrix {
	u16 coef[3][3];
	u8 sub[3];
	u8 add[3];
};

struct sclr_quant_formula {
	u16 sc_frac[3];
	u8 sub[3];
	u16 sub_frac[3];
};

union sclr_intr {
	struct {
		u32 disp_frame_start : 1; //0
		u32 disp_frame_end : 1;
		u32 img_in_d_frame_start : 1; //2
		u32 img_in_d_frame_end : 1;
		u32 img_in_v_frame_start : 1; //4
		u32 img_in_v_frame_end : 1;
		u32 scl0_frame_end : 1; //6
		u32 scl1_frame_end : 1;
		u32 scl2_frame_end : 1;
		u32 scl3_frame_end : 1;
		u32 prog_too_late : 1; //10
		u32 scl0_line_target_hit : 1; //11
		u32 scl1_line_target_hit : 1;
		u32 scl2_line_target_hit : 1;
		u32 scl3_line_target_hit : 1;
		u32 scl0_cycle_line_target_hit : 1; //15
		u32 scl1_cycle_line_target_hit : 1;
		u32 scl2_cycle_line_target_hit : 1;
		u32 scl3_cycle_line_target_hit : 1;
		u32 i80_frame_end : 1; //19
		u32 disp_tgen_lite : 1; //20
		u32 osd_cmp_frame_end : 1; //21
		u32 resv_5 : 5;
		u32 cmdq : 1; //27
		u32 cmdq_start : 1;
		u32 cmdq_end : 1;
		u32 cmdq_lint_hit : 1;
		u32 cmdq_cycle_line_hit : 1;
	} b;
	u32 raw;
};

enum sclr_format {
	SCL_FMT_YUV420,
	SCL_FMT_YUV422,
	SCL_FMT_RGB_PLANAR,
	SCL_FMT_BGR_PACKED, // B lsb
	SCL_FMT_RGB_PACKED, // R lsb
	SCL_FMT_Y_ONLY,
	SCL_FMT_BF16, // odma only
	SCL_FMT_NV12 = 8,
	SCL_FMT_NV21,
	SCL_FMT_YUV422SP1,
	SCL_FMT_YUV422SP2,
	SCL_FMT_YVYU,
	SCL_FMT_YUYV,
	SCL_FMT_VYUY,
	SCL_FMT_UYVY,
	SCL_FMT_MAX
};

enum sclr_out_mode {
	SCL_OUT_CSC,
	SCL_OUT_QUANT,
	SCL_OUT_HSV,
	SCL_OUT_QUANT_BF16,
	SCL_OUT_DISABLE
};

enum sclr_csc {
	SCL_CSC_NONE,
	SCL_CSC_601_LIMIT_YUV2RGB,
	SCL_CSC_601_FULL_YUV2RGB,
	SCL_CSC_709_LIMIT_YUV2RGB,
	SCL_CSC_709_FULL_YUV2RGB,
	SCL_CSC_601_LIMIT_RGB2YUV,
	SCL_CSC_601_FULL_RGB2YUV,
	SCL_CSC_709_LIMIT_RGB2YUV,
	SCL_CSC_709_FULL_RGB2YUV,
	SCL_CSC_MAX,
};


enum sclr_hsv_rounding {
	SCL_HSV_ROUNDING_AWAY_FROM_ZERO = 0,
	SCL_HSV_ROUNDING_TOWARD_ZERO,
	SCL_HSV_ROUNDING_MAX,
};

enum sclr_quant_rounding {
	SCL_QUANT_ROUNDING_TO_EVEN = 0,
	SCL_QUANT_ROUNDING_AWAY_FROM_ZERO = 1,
	SCL_QUANT_ROUNDING_TRUNCATE = 2,
	SCL_QUANT_ROUNDING_MAX,
};

struct sclr_csc_cfg {
	enum sclr_out_mode mode;
	bool work_on_border;
	union {
		enum sclr_csc csc_type;
		struct sclr_quant_formula quant_form;
	};
	union {
		enum sclr_hsv_rounding hsv_round;
		enum sclr_quant_rounding quant_round;
	};

	enum sclr_quant_border_type {
		SCL_QUANT_BORDER_TYPE_255 = 0, // 0 ~ 255
		SCL_QUANT_BORDER_TYPE_127, // -128 ~ 127
		SCL_QUANT_BORDER_TYPE_MAX,
	} quant_border_type;
	enum sclr_quant_gain_mode {
		SCL_QUANT_GAIN_MODE_1 = 0, // max 8191/8192
		SCL_QUANT_GAIN_MODE_2, // max 1 + 4095/4096
		SCL_QUANT_GAIN_MAX,
	} quant_gain_mode;
};

enum sclr_flip_mode {
	SCL_FLIP_NO,
	SCL_FLIP_HFLIP,
	SCL_FLIP_VFLIP,
	SCL_FLIP_HVFLIP,
	SCL_FLIP_MAX
};

enum sclr_gop_format {
	SCL_GOP_FMT_ARGB8888,
	SCL_GOP_FMT_ARGB4444,
	SCL_GOP_FMT_ARGB1555,
	SCL_GOP_FMT_256LUT,
	SCL_GOP_FMT_16LUT,
	SCL_GOP_FMT_FONT,
	SCL_GOP_FMT_MAX
};

enum sclr_disp_drop_mode {
	SCL_DISP_DROP_MODE_DITHER = 1,
	SCL_DISP_DROP_MODE_ROUNDING = 2,
	SCL_DISP_DROP_MODE_DROP = 3,
	SCL_DISP_DROP_MODE_MAX,
};

enum sclr_img_trig_src {
	SCL_IMG_TRIG_SRC_SW = 0,
	SCL_IMG_TRIG_SRC_DISP,
	SCL_IMG_TRIG_SRC_ISP,
	SCL_IMG_TRIG_SRC_MAX,
};

union sclr_top_cfg_01 {
	struct {
		u32 sc_d_enable   : 1;    // 0
		u32 sc_v1_enable  : 1;    // 1
		u32 sc_v2_enable  : 1;    // 2
		u32 sc_v3_enable  : 1;    // 3
		u32 disp_enable   : 1;    // 4: no use anymore
		u32 resv_5	  : 3;    // 5-7
		u32 disp_from_sc  : 1;    // 8: 0(DRAM), 1(SCL_D)
		u32 sc_d_src	  : 1;    // 9: 0(IMG_D), 1(IMG_V)
		u32 sc_rot_sw_rt  : 1;    // 10
		u32 resv_11	  : 1;    // 11
		u32 sc_debug_en   : 1;    // 12
		u32 resv_13	  : 3;    // 13-15
		u32 qos_en        : 8;    // 16
	} b;
	u32 raw;
};

/*
 * reg_sb_wr_ctrl0:
 *   slice buffer push signal (sb_push_128t[0]) to VENC config
 *   0 : sc_d
 *   1 : sc_v1
 *   2 : sc_v2
 *   3 : sc_v3
 *
 * reg_sb_wr_ctrl1:
 *   slice buffer push signal (sb_push_128t[1]) to VENC config
 *   0 : sc_d
 *   1 : sc_v1
 *   2 : sc_v2
 *   3 : sc_v3
 *
 * reg_sb_rd_ctrl:
 *   slice buffer pop signal (sb_pop_128t) to LDC config
 *   0 : img_in_d
 *   1 : img_in_v
 */
struct sclr_top_sb_cfg {
	u8 sb_wr_ctrl0;
	u8 sb_wr_ctrl1;
	u8 sb_rd_ctrl;
};

struct sclr_top_cfg {
	bool ip_trig_src;    // 0(IMG_V), 1(IMG_D)
	bool force_clk_enable;
	bool sclr_enable[SCL_MAX_INST];	// 0(scl_d), 1(sc_v1), 2(sc_v2), 3(sc_v3)
	bool disp_enable;
	bool disp_from_sc;   // 0(DRAM), 1(SCL_D)
	bool sclr_d_src;     // 0(IMG_D), 1(IMG_V)
	enum sclr_img_trig_src img_in_d_trig_src;
	enum sclr_img_trig_src img_in_v_trig_src;
};

struct sclr_bld_cfg {
	union {
		struct {
			u32 enable	 : 1;
